src/DataProcessors/КИИ_ГенераторДиаграмм/КИИ_ГенераторДиаграмм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КИИ_ГенераторДиаграмм</name>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЭкспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTMLДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДиаграммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксперт</name>
    <type>
      <types>CatalogRef.КИИ_ЭкспертыИИ</types>
    </type>
  </attributes>
  <attributes>
    <name>URLKroki</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийSVG</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДиаграммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимГенерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникKroki</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/КИИ_ГенераторДиаграмм/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗагрузитьНастройкиФормы();

	Если ПустаяСтрока(Объект.РежимГенерации) Тогда
		Объект.РежимГенерации = "service";
	КонецЕсли;
	Если ПустаяСтрока(Объект.URLKroki) Тогда
		Объект.URLKroki = "http://localhost:8000";
	КонецЕсли;
	Если ПустаяСтрока(Объект.ТемаДиаграммы) Тогда
		Объект.ТемаДиаграммы = "default";
	КонецЕсли;
	Если ПустаяСтрока(ФонСтраницы) Тогда
		ФонСтраницы = "white";
	КонецЕсли;
	Если ПустаяСтрока(Объект.ИсточникKroki) Тогда
		Объект.ИсточникKroki = "local_docker";
	КонецЕсли;
	Если Объект.Таймаут = 0 Тогда
		Объект.Таймаут = 30;
	КонецЕсли;

	Элементы.СоздатьЭксперта.Видимость = НЕ ЗначениеЗаполнено(Объект.Эксперт);
	УстановитьВидимостьПолейОформленияНаСервере();

	Объект.HTMLДокумент = ПустойHTML();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура HTMLДокументДокументСформирован(Элемент)
	// Обработчик события завершения загрузки HTML-документа.
	// Зарезервирован для будущего использования.
КонецПроцедуры

&НаКлиенте
Процедура URLKrokiПриИзменении(Элемент)

	СохранитьНастройкиФормыНаСервере();

	Если НЕ ПустаяСтрока(Объект.КодДиаграммы) Тогда
		НарисоватьНаСервере(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТемаДиаграммыПриИзменении(Элемент)

	Если Объект.ТемаДиаграммы = "dark" Тогда
		ФонСтраницы = "#1e1e1e";
	Иначе
		ФонСтраницы = "white";
	КонецЕсли;

	Если НЕ ПустаяСтрока(Объект.КодДиаграммы) Тогда
		НарисоватьНаСервере(Ложь);
	КонецЕсли;

	СохранитьНастройкиФормыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ФонСтраницыПриИзменении(Элемент)

	Если Объект.РежимГенерации = "local" Тогда
		Если НЕ ПустаяСтрока(Объект.КодДиаграммы) Тогда
			НарисоватьНаСервере(Ложь);
		КонецЕсли;
	Иначе
		Если НЕ ПустаяСтрока(Объект.ТекущийSVG) Тогда
			ОтобразитьSVGНаСервере();
		КонецЕсли;
	КонецЕсли;

	СохранитьНастройкиФормыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЭкспертПриИзменении(Элемент)

	Элементы.СоздатьЭксперта.Видимость = НЕ ЗначениеЗаполнено(Объект.Эксперт);
	СохранитьНастройкиФормыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ИсточникKrokiПриИзменении(Элемент)
	URLПоИсточнику = Новый Соответствие;
	URLПоИсточнику.Вставить("cloud", "https://kroki.io");
	URLПоИсточнику.Вставить("local_docker", "http://localhost:8000");
	НовыйURL = URLПоИсточнику.Получить(Объект.ИсточникKroki);
	Если НовыйURL <> Неопределено Тогда
		Объект.URLKroki = НовыйURL;
	КонецЕсли;
	СохранитьНастройкиФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаймаутKrokiПриИзменении(Элемент)
	СохранитьНастройкиФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РежимГенерацииПриИзменении(Элемент)

	УстановитьВидимостьПолейОформления();
	СохранитьНастройкиФормыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ТипДиаграммыПриИзменении(Элемент)

	СохранитьНастройкиФормыНаСервере();

	Если НЕ ПустаяСтрока(Объект.КодДиаграммы) Тогда
		НарисоватьНаСервере(Ложь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Нарисовать(Команда)

	Если ПустаяСтрока(Объект.ОписаниеДиаграммы) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Введите описание или код диаграммы'"));
		Возврат;
	КонецЕсли;

	Если ЭтоКодДиаграммыНаСервере(Объект.ОписаниеДиаграммы) Тогда
		Объект.КодДиаграммы = СокрЛП(Объект.ОписаниеДиаграммы);
		НарисоватьНаСервере();
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Эксперт) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите эксперта ИИ или создайте его кнопкой «Создать эксперта»'"));
		Возврат;
	КонецЕсли;

	УстановитьДоступностьКнопок(Ложь);
	ЗапуститьГенерациюВФоне();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьKroki(Команда)
	Результат = ПроверитьKrokiНаСервере();
	Если Результат.Доступен Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Kroki'"), , Результат.Сообщение, БиблиотекаКартинок.Информация32);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьSVG(Команда)

	Если ПустаяСтрока(Объект.ТекущийSVG) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Диаграмма не готова. Сначала нарисуйте диаграмму.'"));
		Возврат;
	КонецЕсли;

	Попытка
		АдресФайла = СохранитьSVGНаСервере();
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(АдресФайла, "diagram.svg"));
		Ждать ПолучитьФайлыССервераАсинх(МассивФайлов);
	Исключение
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка сохранения SVG: %1'"), ОписаниеОшибки());
		ПоказатьПредупреждение(, СообщениеОбОшибке);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьPNG(Команда)

	Если ПустаяСтрока(Объект.КодДиаграммы) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Диаграмма не готова. Сначала нарисуйте диаграмму.'"));
		Возврат;
	КонецЕсли;

	Попытка
		АдресФайла = СохранитьPNGНаСервере();
		Если ПустаяСтрока(АдресФайла) Тогда
			Возврат;
		КонецЕсли;
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(АдресФайла, "diagram.png"));
		Ждать ПолучитьФайлыССервераАсинх(МассивФайлов);
	Исключение
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка сохранения PNG: %1'"), ОписаниеОшибки());
		ПоказатьПредупреждение(, СообщениеОбОшибке);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьPDF(Команда)

	Если ПустаяСтрока(Объект.КодДиаграммы) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Диаграмма не готова. Сначала нарисуйте диаграмму.'"));
		Возврат;
	КонецЕсли;

	Попытка
		АдресФайла = СохранитьPDFНаСервере();
		Если ПустаяСтрока(АдресФайла) Тогда
			Возврат;
		КонецЕсли;
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(АдресФайла, "diagram.pdf"));
		Ждать ПолучитьФайлыССервераАсинх(МассивФайлов);
	Исключение
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка сохранения PDF: %1'"), ОписаниеОшибки());
		ПоказатьПредупреждение(, СообщениеОбОшибке);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)

	Объект.ОписаниеДиаграммы = "";
	Объект.КодДиаграммы         = "";
	Объект.ТекущийSVG         = "";
	Объект.ВидДиаграммы       = "";
	Объект.HTMLДокумент       = ПустойHTML();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭксперта(Команда)

	ТекстВопроса = НСтр("ru = 'Создать предзаполненного эксперта ИИ для генерации диаграмм?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияСозданияЭксперта", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьKrokiНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	URLKroki = СокрЛП(ОбработкаОбъект.URLKroki);
	Если ПустаяСтрока(URLKroki) Тогда
		URLKroki = "http://localhost:8000";
	КонецЕсли;
	Таймаут = ОбработкаОбъект.Таймаут;
	Если Таймаут <= 0 Тогда
		Таймаут = 5;
	КонецЕсли;
	МаксТаймаут = Мин(Таймаут, 10);
	Возврат ОбработкаОбъект.ПроверитьДоступностьKroki(URLKroki, МаксТаймаут);
КонецФункции

&НаСервере
Функция СохранитьPDFНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КодДиаграммы = СокрЛП(ОбработкаОбъект.КодДиаграммы);
	Если ПустаяСтрока(КодДиаграммы) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет кода диаграммы для экспорта в PDF'"));
		Возврат "";
	КонецЕсли;
	ВидДиаграммы = СокрЛП(ОбработкаОбъект.ВидДиаграммы);
	Если ПустаяСтрока(ВидДиаграммы) Тогда
		ВидДиаграммы = ОбработкаОбъект.ОпределитьВидДиаграммы(КодДиаграммы);
	КонецЕсли;
	URLKroki = СокрЛП(ОбработкаОбъект.URLKroki);
	Если ПустаяСтрока(URLKroki) Тогда
		URLKroki = "http://localhost:8000";
	КонецЕсли;
	Таймаут = ОбработкаОбъект.Таймаут;
	Если Таймаут <= 0 Тогда
		Таймаут = 30;
	КонецЕсли;
	ПараметрыKroki = ОбработкаОбъект.НовыеПараметрыРендеринга();
	ПараметрыKroki.URLKroki = URLKroki;
	ПараметрыKroki.Тема     = ОбработкаОбъект.ТемаДиаграммы;
	ПараметрыKroki.Формат   = "pdf";
	ПараметрыKroki.Таймаут  = Таймаут;
	РезультатKroki = ОбработкаОбъект.РендеритьЧерезKroki(
		КодДиаграммы, ВидДиаграммы, ПараметрыKroki);
	Если НЕ РезультатKroki.Успех Тогда
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка экспорта PDF: %1'"), РезультатKroki.ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		Возврат "";
	КонецЕсли;
	Возврат ПоместитьВоВременноеХранилище(РезультатKroki.ДвоичныеДанные, УникальныйИдентификатор);
КонецФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ПослеПодтвержденияСозданияЭксперта(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	СоздатьЭкспертаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеГенерации(Результат, ДополнительныеПараметры) Экспорт

	УстановитьДоступностьКнопок(Истина);

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		Если Результат.ИнформацияОбОшибке <> Неопределено Тогда
			ДетальОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке);
		Иначе
			ДетальОшибки = Результат.КраткоеПредставлениеОшибки;
		КонецЕсли;
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка генерации:%1%2'"), Символы.ПС, ДетальОшибки);
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьРезультатГенерацииНаСервере(Результат.АдресРезультата);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОтрисовкаДиаграммы

&НаСервере
Процедура НарисоватьНаСервере(Знач ОпределятьТип = Истина)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	Если ОпределятьТип Тогда
		Объект.ВидДиаграммы = ОбработкаОбъект.ОпределитьВидДиаграммы(Объект.КодДиаграммы);
	КонецЕсли;

	Если Объект.РежимГенерации = "local" Тогда
		Объект.ТекущийSVG   = "";
		Объект.HTMLДокумент = ОбработкаОбъект.HTMLДиаграммыMermaid(
			Объект.КодДиаграммы, Объект.ТемаДиаграммы, ФонСтраницы);
		Возврат;
	КонецЕсли;

	Таймаут = Объект.Таймаут;
	Если Таймаут <= 0 Тогда
		Таймаут = 30;
	КонецЕсли;
	ПараметрыKroki = ОбработкаОбъект.НовыеПараметрыРендеринга();
	ПараметрыKroki.URLKroki = Объект.URLKroki;
	ПараметрыKroki.Тема     = Объект.ТемаДиаграммы;
	ПараметрыKroki.Таймаут  = Таймаут;
	РезультатKroki = ОбработкаОбъект.РендеритьЧерезKroki(
		Объект.КодДиаграммы, Объект.ВидДиаграммы, ПараметрыKroki);

	Если РезультатKroki.Успех Тогда
		Объект.ТекущийSVG   = РезультатKroki.SVGТекст;
		Объект.HTMLДокумент = ОбработкаОбъект.ПостроитьHTMLДляПросмотра(
			РезультатKroki.SVGТекст, ФонСтраницы);
	Иначе
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка рендеринга: %1'"), РезультатKroki.ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтобразитьSVGНаСервере()

	Если ПустаяСтрока(Объект.ТекущийSVG) Тогда
		Возврат;
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.HTMLДокумент = ОбработкаОбъект.ПостроитьHTMLДляПросмотра(
		Объект.ТекущийSVG, ФонСтраницы);

КонецПроцедуры

#КонецОбласти

#Область ГенерацияЧерезИИ

&НаКлиенте
Процедура ЗапуститьГенерациюВФоне()

	Попытка
		ФоновоеЗадание = ЗапуститьГенерациюВФонеНаСервере(Объект.ОписаниеДиаграммы, Объект.Эксперт);
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка запуска генерации:%1%2'"),
			Символы.ПС,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ПоказатьПредупреждение(, ТекстОшибки);
		УстановитьДоступностьКнопок(Истина);
		Возврат;
	КонецПопытки;

	Если ФоновоеЗадание = Неопределено Тогда
		УстановитьДоступностьКнопок(Истина);
		Возврат;
	КонецЕсли;

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания       = Истина;
	ПараметрыОжидания.ТекстСообщения             = НСтр("ru = 'Генерация диаграммы через ИИ...'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения          = Ложь;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗавершениеГенерации", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьГенерациюВФонеНаСервере(Знач ОписаниеДиаграммы, Знач Эксперт)

	Если НЕ ЗначениеЗаполнено(Эксперт) Тогда
		ВызватьИсключение НСтр("ru = 'Не выбран эксперт ИИ'");
	КонецЕсли;

	Модель          = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "Модель");
	СистемныйПромпт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Эксперт, "ОписаниеЭксперта");

	Промпт = Новый Структура;
	Промпт.Вставить("СистемныйПромпт",        СистемныйПромпт);
	Промпт.Вставить("ПользовательскийПромпт", ОписаниеДиаграммы);
	Промпт.Вставить("ИсторияСообщений",       Новый Массив);

	Возврат КИИ_КоннекторИИ.ЗапросКМоделиВФоне(Модель, Промпт);

КонецФункции

&НаСервере
Процедура ОбработатьРезультатГенерацииНаСервере(Знач АдресРезультата)

	Попытка
		РезультатИИ = ПолучитьИзВременногоХранилища(АдресРезультата);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ИИКона.ГенераторДиаграмм'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не удалось получить результат генерации'"));
		Возврат;
	КонецПопытки;

	Если РезультатИИ.ЭтоОшибка Тогда
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'ИИ вернул ошибку: %1'"), РезультатИИ.ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		Возврат;
	КонецЕсли;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КодДиаграммы = ОбработкаОбъект.ИзвлечьКодИзОтветаИИ(РезультатИИ.ТекстОтвета);

	Если ПустаяСтрока(КодДиаграммы) Тогда
		СообщениеОбОшибке = СтрШаблон(
			НСтр("ru = 'ИИ не вернул распознаваемый код диаграммы.%1Ответ ИИ:%1%2'"),
			Символы.ПС,
			РезультатИИ.ТекстОтвета);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		Возврат;
	КонецЕсли;

	Объект.КодДиаграммы = КодДиаграммы;
	НарисоватьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область НастройкиФормы

&НаСервере
Процедура ЗагрузитьНастройкиФормы()

	КлючОбъекта = "Обработка.КИИ_ГенераторДиаграмм";

	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбъекта, "НастройкиФормы");

	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если Настройки.Свойство("РежимГенерации") И НЕ ПустаяСтрока(Настройки.РежимГенерации) Тогда
		Объект.РежимГенерации = Настройки.РежимГенерации;
	КонецЕсли;

	Если Настройки.Свойство("ПоследнийЭксперт") И ЗначениеЗаполнено(Настройки.ПоследнийЭксперт) Тогда
		Объект.Эксперт = Настройки.ПоследнийЭксперт;
	КонецЕсли;

	Если Настройки.Свойство("URLKroki") И НЕ ПустаяСтрока(Настройки.URLKroki) Тогда
		Объект.URLKroki = Настройки.URLKroki;
	КонецЕсли;

	Если Настройки.Свойство("ТемаДиаграммы") И НЕ ПустаяСтрока(Настройки.ТемаДиаграммы) Тогда
		Объект.ТемаДиаграммы = Настройки.ТемаДиаграммы;
	КонецЕсли;

	Если Настройки.Свойство("ФонСтраницы") И НЕ ПустаяСтрока(Настройки.ФонСтраницы) Тогда
		ФонСтраницы = Настройки.ФонСтраницы;
	КонецЕсли;

	Если Настройки.Свойство("Таймаут") И Настройки.Таймаут > 0 Тогда
		Объект.Таймаут = Настройки.Таймаут;
	КонецЕсли;

	Если Настройки.Свойство("ИсточникKroki") И НЕ ПустаяСтрока(Настройки.ИсточникKroki) Тогда
		Объект.ИсточникKroki = Настройки.ИсточникKroki;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()

	КлючОбъекта = "Обработка.КИИ_ГенераторДиаграмм";

	Настройки = Новый Структура;
	Настройки.Вставить("РежимГенерации",   Объект.РежимГенерации);
	Настройки.Вставить("ПоследнийЭксперт", Объект.Эксперт);
	Настройки.Вставить("URLKroki",         Объект.URLKroki);
	Настройки.Вставить("ТемаДиаграммы",    Объект.ТемаДиаграммы);
	Настройки.Вставить("ФонСтраницы",      ФонСтраницы);
	Настройки.Вставить("Таймаут",     Объект.Таймаут);
	Настройки.Вставить("ИсточникKroki",    Объект.ИсточникKroki);

	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбъекта, "НастройкиФормы", Настройки);

КонецПроцедуры

#КонецОбласти

#Область СохранениеФайлов

&НаСервере
Функция СохранитьSVGНаСервере()

	ИмяФайла     = ПолучитьИмяВременногоФайла("svg");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(Объект.ТекущийSVG);
	ЗаписьТекста.Закрыть();
	АдресФайла = ПоместитьВоВременноеХранилище(
		Новый ДвоичныеДанные(ИмяФайла),
		УникальныйИдентификатор);
	УдалитьФайлы(ИмяФайла);
	Возврат АдресФайла;

КонецФункции

&НаСервере
Функция СохранитьPNGНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	КодДиаграммы = СокрЛП(ОбработкаОбъект.КодДиаграммы);
	Если ПустаяСтрока(КодДиаграммы) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет кода диаграммы для экспорта в PNG'"));
		Возврат "";
	КонецЕсли;

	ВидДиаграммы = СокрЛП(ОбработкаОбъект.ВидДиаграммы);
	Если ПустаяСтрока(ВидДиаграммы) Тогда
		ВидДиаграммы = ОбработкаОбъект.ОпределитьВидДиаграммы(КодДиаграммы);
	КонецЕсли;

	URLKroki = СокрЛП(ОбработкаОбъект.URLKroki);
	Если ПустаяСтрока(URLKroki) Тогда
		URLKroki = "http://localhost:8000";
	КонецЕсли;

	Таймаут = ОбработкаОбъект.Таймаут;
	Если Таймаут <= 0 Тогда
		Таймаут = 30;
	КонецЕсли;

	ПараметрыKroki = ОбработкаОбъект.НовыеПараметрыРендеринга();
	ПараметрыKroki.URLKroki = URLKroki;
	ПараметрыKroki.Тема     = ОбработкаОбъект.ТемаДиаграммы;
	ПараметрыKroki.Формат   = "png";
	ПараметрыKroki.Таймаут  = Таймаут;
	РезультатKroki = ОбработкаОбъект.РендеритьЧерезKroki(
		КодДиаграммы, ВидДиаграммы, ПараметрыKroki);

	Если НЕ РезультатKroki.Успех Тогда
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка экспорта PNG: %1'"), РезультатKroki.ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
		Возврат "";
	КонецЕсли;

	Возврат ПоместитьВоВременноеХранилище(РезультатKroki.ДвоичныеДанные, УникальныйИдентификатор);

КонецФункции

#КонецОбласти

#Область СозданиеЭксперта

&НаСервере
Процедура СоздатьЭкспертаНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.СоздатьПредзаполненногоЭксперта();

	Если Результат.Успех Тогда
		Объект.Эксперт = Результат.Эксперт;
		СохранитьНастройкиФормыНаСервере();
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Эксперт успешно создан. Укажите модель ИИ в карточке эксперта.'"));
	Иначе
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка создания эксперта:%1%2'"),
			Символы.ПС, Результат.ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеПроцедуры
&НаКлиенте
Процедура УстановитьДоступностьКнопок(Доступность)

	Элементы.Нарисовать.Доступность = Доступность;
	Если Элементы.СоздатьЭксперта.Видимость Тогда
		Элементы.СоздатьЭксперта.Доступность = Доступность;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолейОформления()

	ЭтоСервис = (Объект.РежимГенерации = "service");

	Элементы.URLKroki.Видимость        = ЭтоСервис;
	Элементы.ТипДиаграммы.Видимость    = ЭтоСервис;
	Элементы.ТемаДиаграммы.Видимость   = Истина;
	Элементы.ИсточникKroki.Видимость   = ЭтоСервис;
	Элементы.ТаймаутKroki.Видимость    = ЭтоСервис;
	Элементы.ПроверитьKroki.Видимость  = ЭтоСервис;

	Если НЕ ЭтоСервис Тогда
		Объект.ВидДиаграммы = "mermaid";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПолейОформленияНаСервере()

	ЭтоСервис = (Объект.РежимГенерации = "service");

	Элементы.URLKroki.Видимость       = ЭтоСервис;
	Элементы.ТипДиаграммы.Видимость   = ЭтоСервис;
	Элементы.ИсточникKroki.Видимость  = ЭтоСервис;
	Элементы.ТаймаутKroki.Видимость   = ЭтоСервис;
	Элементы.ПроверитьKroki.Видимость = ЭтоСервис;

	Если НЕ ЭтоСервис Тогда
		Объект.ВидДиаграммы = "mermaid";
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоКодДиаграммыНаСервере(Знач Текст)

	Обработка = Обработки.КИИ_ГенераторДиаграмм.Создать();
	Возврат Обработка.ЭтоГотовыйКодДиаграммы(Текст);

КонецФункции

&НаСервере
Функция ПустойHTML()

	Возврат "<!DOCTYPE html><html><head><meta charset=""UTF-8""></head>"
		+ "<body style=""margin:0;padding:16px;color:#888;font-family:sans-serif;"">"
		+ "<p>" + НСтр("ru = 'Введите описание диаграммы и нажмите «Нарисовать»'") + "</p>"
		+ "</body></html>";

КонецФункции

#КонецОбласти

#КонецОбласти
